src/tests/performance-test-polling.yml
#
# Requires artillery.io installed.
#   Install on linux (debian) by running:
#     sudo npm install -g artillery
# Run from terminal:
#   artillery run -o result.json performance-test.yml
# To generate a report run:
#   artillery report result.json
#
config:
  target: "http://codecloud.local:8080"
  processor: "./utility.js" # Custom utility functions for query parameters etc.
  phases:
    - duration: 60 # The duration of the test in seconds
      arrivalRate: 5 # The average number of virtual users pr. sec.
scenarios:
  - name: "Simulate an ultra fast typist (~100 WPM) that types in the editor"
    weight: 2 # Average of 2% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      #- think: 5 # BEWARE!! Think may cause a LOT of ECONNRESET errors when testing..
      - function: "setGuid"
      - loop: # Loop the sendText api
        - patch:
            url: "/api/sendText?guid={{ guid }}"
            headers:
                Content-Type: "application/json; charset=utf-8"
            body: >
                {"action":"insert","positionStart":{"row":0,"column":0},"content":["u\n"],"positionEnd":{"row":0,"column":1}}
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 0.110 # Wait X seconds before sending new data
        count: 530 # Simulate X amount of character sent
  - name: "Simulate a fast typist (~50 WPM) that types in the editor"
    weight: 8 # Average of 8% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      - function: "setGuid"
      - loop: # Loop the sendText api
        - patch:
            url: "/api/sendText?guid={{ guid }}"
            headers:
                Content-Type: "application/json; charset=utf-8"
            body: >
                {"action":"insert","positionStart":{"row":0,"column":0},"content":["f\n"],"positionEnd":{"row":0,"column":1}}
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 0.240 # Wait X seconds before sending new data
        count: 250 # Simulate X amount of character sent
  - name: "Simulate an average (~25 WPM) typist that types in the editor"
    weight: 20 # Average of 20% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      - function: "setGuid"
      - loop: # Loop the sendText api
        - patch:
            url: "/api/sendText?guid={{ guid }}"
            headers:
                Content-Type: "application/json; charset=utf-8"
            body: >
                {"action":"insert","positionStart":{"row":0,"column":0},"content":["a\n"],"positionEnd":{"row":0,"column":1}}
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 0.480 # Wait X seconds before sending new data
        count: 125 # Simulate X amount of character sent
  - name: "Simulate a slow (~10 WPM) typist that types in the editor"
    weight: 50 # Average of 50% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      #- think: 5 # BEWARE!! Think may cause a LOT of ECONNRESET errors when testing..
      - function: "setGuid"
      - loop: # Loop the sendText api
        - patch:
            url: "/api/sendText?guid={{ guid }}"
            headers:
                Content-Type: "application/json; charset=utf-8"
            body: >
                {"action":"insert","positionStart":{"row":0,"column":0},"content":["s\n"],"positionEnd":{"row":0,"column":1}}
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 1 # Wait X seconds before sending new data
        count: 60 # Simulate X amount of character sent
  - name: "Simulate a copy/paste user that uses the editor"
    weight: 10 # Average of 10% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      #- think: 5 # BEWARE!! Think may cause a LOT of ECONNRESET errors when testing..
      - function: "setGuid"
      - loop: # Loop the sendText api
        - patch:
            url: "/api/sendText?guid={{ guid }}"
            headers:
                Content-Type: "application/json; charset=utf-8"
            body: >
                {"action":"insert","positionStart":{"row":0,"column":0},"content":["Copy/pasted\n"],"positionEnd":{"row":0,"column":1}}
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 4 # Wait X seconds before sending new data
        count: 15 # Simulate X amount of character sent
  - name: "Simulate a lurker on the main page"
    weight: 10 # Average of 10% of all users
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - get:
          url: "/api/file" # Get the file
      - function: "setGuid"
      - loop: # Loop the sendText api
        - get:
            url: "/api/file" # Simulate the polling mechanism, which basically sends the whole file back to the client after a change is made.
        - think: 0.5 # Wait X seconds before sending new data
        count: 60 # Simulate X amount of character sent