src/tests/performance-test.yml
#
# Requires artillery.io installed.
#   Install on linux (debian) by running:
#     sudo npm install -g artillery
# Run from terminal:
#   artillery run -o result.json performance-test.yml
# To generate a report run:
#   artillery report result.json
#
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60 # The duration of the test in seconds
      arrivalRate: 20 # The average number of virtual users pr. sec.
scenarios:
  - name: "Request the main page"
    engine: "socketio" # Use socketio connection
    flow:
      - get:
          url: "/" # Regular HTTP GET request
      - emit:
          channel: "getText" # The event to send to the server
          namespace: "/collab" # The namespace for the socket defined by the server
      - think: 5 # Sit and lurk in the channel
      - emit:
          channel: "sendText"
          data: >
              {"action":"insert","positionStart":{"row":0,"column":0},"content":["|-0-|\n"],"positionEnd":{"row":0,"column":1}}
          namespace: "/collab"
      - think: 15
      - emit:
          channel: "sendText"
          data: >
              {"action":"insert","positionStart":{"row":3,"column":5},"content":["|-0-|"],"positionEnd":{"row":3,"column":10}}
          namespace: "/collab"
      - think: 15